{
  "title": "תנאי שימוש בקורס Video-Pro",
  "content": "תנאי שימוש אלה מגדירים את ההסכם המשפטי בינך לבין ערן פרקש, מפיק קורס הוידאו \"Video-Pro\" (להלן: \"הקורס\", בנוגע לשימושך בחומרי הקורס.\n\n**זכויות יוצרים:**\n\nכל חומרי הקורס, לרבות סרטי וידאו, מדריכים כתובים, וובינרים, תוכן כתוב ומצולם, וכל חומר נוסף שיסופק כחלק מהקורס (להלן: \"החומרים\", הם קניינם הרוחני של ערן פרקש ובעלי הקורס Video-Pro ו/או של צדדים שלישיים אשר העניקו לערן פרקש רישיון לשימוש בחומרים. כל הזכויות בחומרים, לרבות זכויות היוצרים, שמורות לערן פרקש ולצדדים השלישיים.\n\n**שימוש אישי:**\n\nהחומרים מיועדים לשימושך האישי והבלעדי בלבד. אין להעתיק, לשכפל, להפיץ, לשווק, למכור, להעביר, לשנות, לתרגם או ליצור עבודות נגזרות מהחומרים, בין אם במלואם ובין בחלקם, בכל צורה ובכל אמצעי, אלקטרוני, מכני, אופטי, או בכל אמצעי אחר, ללא קבלת הסכמתו המפורשת מראש ובכתב של ערן פרקש.\n\n**הגבלות על השימוש:**\n\n1. **שימוש מסחרי:** אין להשתמש בחומרים לצורך כל פעילות מסחרית, לרבות מכירתם, השכרתם, או שימוש בהם לצורך קידום מוצרים או שירותים.\n2. **הפצה:** אין להפיץ את החומרים לצד שלישי, בין אם בתשלום ובין בחינם, באופן ישיר או עקיף.\n3. **שינוי:** אין לשנות, לערוך או ליצור עבודות נגזרות מהחומרים.\n4. **הורדה:** הורדת החומרים מותרת לשימושך האישי בלבד. אין להוריד את החומרים למחשב ציבורי או לשרת.\n\n**החזר כספי:**\n\nבמידה ואינך מרוצה מהקורס, תוכל לבקש החזר כספי תוך 14 יום מיום רכישת הקורס.\n\n**התחיבות לפרויקט בתשלום**\n\n 1. לסטודנטים במסלול Master-Pro בלבד, תינתן התחייבות לקבלת פרויקט ראשון בתשלום (להלן 'עבודה ראשונה') בסכום של עד 500₪ ותוך 3 חודשים מסיום כל מטלות הקורס, בכפוף להשלמת תיק עבודות בהתאם להדרכות ולרמה הנדרשת בקורס, הפרויקט ינתן ליחיד או לנבחרת של יוצרי תוכן.\n2. זאת מבלי לגרוע מהשאיפה של בעלי הקורס לייצר חיבורים, עבודות והזדמנויות עבור יוצרי התוכן של הקורס באופן שוטף, בדגש על סטודנטים ונבחרות של יוצרי תוכן אשר ימצאו מתאימים להוביל. \n\n**שינויים בתנאי השימוש:**\n\nערן פרקש שומר לעצמו את הזכות לשנות את תנאי שימוש אלה מעת לעת. השינויים יחלו לחול החל ממועד פרסומם באתר האינטרנט של הקורס.\n\n**שונות:**\n\nאם הוראה כלשהי בתנאי שימוש אלה תיפסל או תיחשב כבלתי תקפה, לא תשפיע ההוראה על תוקפן של יתר ההוראות.\n\n**חוק השיפוט:**\n\nעל תנאי שימוש אלה יחולו דיני מדינת ישראל בתחום שיפוט תל אביב.\n\n**יצירת קשר:**\n\nלכל שאלה הנוגעת לתנאי שימוש אלה, אנא פנה לערן פרקש באמצעות פרטי ההתקשרות המופיעים באתר האינטרנט של הקורס.\n\n**הצהרת הסכמה:**\n\nבהרשמתך לקורס, הנך מאשר כי קראת והבנת תנאי שימוש אלה וכי הנך מסכים להתחייב להם.",
  "author": "ערן פרקש"
}

